app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @role = Role.find(params[:id])

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @role = Role.find(params[:id])

INSERT INTO "roles" ("created_at", "created_by", "rolename", "updated_at", "updated_by") VALUES (?, ?, ?, ?, ?)  [["created_at", 2012-07-02 14:41:01 +0530], ["created_by", "devaraj"], ["rolename", "developer"], ["updated_at", 2012-07-02 09:11:01 UTC], ["updated_by", nil]]
---
  def create
    @role = Role.new(params[:role])
    @role.created_at = Time.new

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "roles" SET "rolename" = 'developers', "updated_at" = '2012-07-02 09:11:10.502805' WHERE "roles"."id" = 1
---
  def update
    @role = Role.find(params[:id])

    respond_to do |format|
      if @role.update_attributes(params[:role])