app/controllers/users_controller.rb

SELECT "roles".* FROM "roles"
---
  def new
    @user = User.new
    @roles = Role.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "roles".* FROM "roles"
---
  def edit
    @user = User.find(params[:id])
    @roles = Role.all

INSERT INTO "users" ("created_at", "created_by", "email", "password", "role_id", "updated_at", "updated_by", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    @user.created_by="devaraj"